Note/Tailrec.org
#+Title:  Tail recursion optimization
#+Author: Comcx

#+SETUPFILE: theme-readtheorg-local.setup


Many algorithms can be expressed concisely and elegantly in functional languages with recursions.
However, not all languages support automatic optimizations respect to functional algorithms and,
some languages(such as /Scala/), although support basic =@tailrec= optimizations by code transformation,
they still can not do some agressive tailrec optimizations such as =CPS tailrec=.

Therefore, we need to transform programs by hand. With this technique, we can use functional style
fearlessly for that we can translate our code into traditional imperative ways.

In studying this, *Scala* can play an important role in tranlating our programs since /Scala/ support
many different programming strategies. To make our method more impressive, we will finally try to translate
programs into effective *C++* codes.

We follow this program route:
#+BEGIN_SRC 
Haskell ==> Scala ==> C++
#+END_SRC

(This is just a try, still not sure if I can make it :-)


** Tailrec strategies

*** Linear recursion
**** Formalization
To make things simple but not stupid, we firstly only focus on recursions whose
last expression only contains one recursion
(which means we do not discuss tree recursion right now).

#+BEGIN_SRC haskell
rec 1 = some value
rec x = f x (rec (h x))
#+END_SRC

Now we unfold this recursion:
#+BEGIN_SRC haskell
rec x = f x $ f (h x) $ f (h $ h x) $ f (h $ h $ h x) $ ... $ f (h $ h $ ... $ h $ x) $ (some value)
#+END_SRC

Hummmmm, it looks even more complex...
I now have two guesses on how to do tailrec for codes like this:
1) Build from bottom or reverse order
2) Do /CPS/ transformation

Let's try the first one first.
To build from bottom, we need to know the most important parameter: =(h $ h $ ... $ x)=.
To know this parameter, we need to know how many times the function =h= was
applied to =x=. We can find some clues from the terminating pattern of =rec=.

**** Reverse order
- Our current problem:

  #+BEGIN_SRC 
  We have a function (h :: a -> a) which do transformations of x and
  we need to figure out that how many times h applied to x in order to
  reach the value '1'(some constant or pattern) in the terminating definiton of rec.
  #+END_SRC

***** *If h is reversible(noted h', i.e. h . h' = id)*

    we can build from bottom!
    Notice that we need to pass our value of each layer to upper layer,
    so we need one more parameter to record our current result.
#+BEGIN_SRC haskell
reverseBuild f h x res = f x res
reverseBuild f h y res = reverseBuild f h (h' y) (f y res)
#+END_SRC
    * use foldl, foldr?

***** *else h is not reversible:(*

    well, which means we can't get results from bottom, we have to start from
    head since we can not calculate (h $ h $ ... $ x). Maybe we need another strategy.

***** *To change order... How about =Monoid=?*

    Suppose we want to get the sum of a list:
#+BEGIN_SRC haskell
sum [] = 0
sum (x:xs) = x + sum xs
#+END_SRC
    where, =(+)= becomes the function =f=.

    Since (a + b) + c === a + (b + c),
    we can reverse the calculation order
#+BEGIN_SRC haskell
a + (b + (c + d))
#+END_SRC
    to
#+BEGIN_SRC haskell
((a + b) + c) + d
#+END_SRC
    It's just like to say that, we can change the calculation of
#+BEGIN_SRC haskell
x (h x) (h $ h x) ... (h $ h $ ... $ h x)
#+END_SRC
    with =f=.

    Let's try to implement this transformation with our general code:
#+BEGIN_SRC haskell
reverseOrder f h 1 res = res
reverseOrder f h x res = reverseOrder f h (h x) (f x (h x))
#+END_SRC
    This time we don't need =h'=!

