Note/Tailrec.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-26 周三 22:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tail recursion optimization</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
<link rel="stylesheet" type="text/css" href="org-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="org-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="icon" type="image/x-icon" href="../images/digimon-icon.png" />
</head>
<body>
<div id="content">
<h1 class="title">Tail recursion optimization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfab54c8">1. Tailrec strategies</a>
<ul>
<li><a href="#org395588f">1.1. Linear recursion</a>
<ul>
<li><a href="#orgde9bdf3">1.1.1. Formalization</a></li>
<li><a href="#org80fcf44">1.1.2. Reverse order</a></li>
<li><a href="#orgd4d3431">1.1.3. CPS trasformation</a></li>
<li><a href="#org9fbdd0d">1.1.4. Summary</a></li>
</ul>
</li>
<li><a href="#org18f9b21">1.2. Tree recursion</a>
<ul>
<li><a href="#orge8f2ddb">1.2.1. Two-branch tree recursion</a></li>
<li><a href="#org90a4c7c">1.2.2. N-branch tree recursion</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd5cddf5">2. Examples</a>
<ul>
<li><a href="#org6911735">2.1. Selection sort</a></li>
<li><a href="#orga0abe8c">2.2. Fibonacci</a></li>
<li><a href="#org38b745c">2.3. Permutations</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Many algorithms can be expressed concisely and elegantly in functional languages with recursions.
However, not all languages support automatic optimizations respect to functional algorithms and,
some languages(such as <i>Scala</i>), although support basic <code>@tailrec</code> optimizations by code transformation,
they still can not do some agressive tailrec optimizations such as <code>CPS tailrec</code>.
</p>

<p>
Therefore, we need to transform programs by hand. With this technique, we can use functional style
fearlessly for that we can translate our code into traditional imperative ways.
</p>

<p>
In studying this, <b>Scala</b> can play an important role in tranlating our programs since <i>Scala</i> support
many different programming strategies. To make our method more impressive, we will finally try to translate
programs into effective <b>C++</b> codes.
</p>

<p>
We follow this program route:
</p>
<pre class="example">
Haskell ==&gt; Scala ==&gt; C++
</pre>

<p>
(This is just a try, still not sure if I can make it :-)
</p>


<div id="outline-container-orgfab54c8" class="outline-2">
<h2 id="orgfab54c8"><span class="section-number-2">1</span> Tailrec strategies</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org395588f" class="outline-3">
<h3 id="org395588f"><span class="section-number-3">1.1</span> Linear recursion</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgde9bdf3" class="outline-4">
<h4 id="orgde9bdf3"><span class="section-number-4">1.1.1</span> Formalization</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
To make things simple but not stupid, we firstly only focus on recursions whose
last expression only contains one recursion
(which means we do not discuss tree recursion right now).
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #729fcf; font-weight: bold;">rec</span> 1 <span style="color: #ff6347;">=</span> some value
<span style="color: #729fcf; font-weight: bold;">rec</span> x <span style="color: #ff6347;">=</span> f x <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
Now we unfold this recursion:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #729fcf; font-weight: bold;">rec</span> x <span style="color: #ff6347;">=</span> f x <span style="color: #ff6347;">$</span> f <span style="color: #ffd700;">(</span>h x<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">$</span> f <span style="color: #ffd700;">(</span>h <span style="color: #ff6347;">$</span> h x<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">$</span> f <span style="color: #ffd700;">(</span>h <span style="color: #ff6347;">$</span> h <span style="color: #ff6347;">$</span> h x<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">$</span> <span style="color: #ff6347;">...</span> <span style="color: #ff6347;">$</span> f <span style="color: #ffd700;">(</span>h <span style="color: #ff6347;">$</span> h <span style="color: #ff6347;">$</span> <span style="color: #ff6347;">...</span> <span style="color: #ff6347;">$</span> h <span style="color: #ff6347;">$</span> x<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">$</span> <span style="color: #ffd700;">(</span>some value<span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
Hummmmm, it looks even more complex&#x2026;
I now have two guesses on how to do tailrec for codes like this:
</p>
<ol class="org-ol">
<li>Build from bottom or reverse order</li>
<li>Do <i>CPS</i> transformation</li>
</ol>

<p>
Let's try the first one first.
To build from bottom, we need to know the most important parameter: <code>(h $ h $ ... $ x)</code>.
To know this parameter, we need to know how many times the function <code>h</code> was
applied to <code>x</code>. We can find some clues from the terminating pattern of <code>rec</code>.
</p>
</div>
</div>

<div id="outline-container-org80fcf44" class="outline-4">
<h4 id="org80fcf44"><span class="section-number-4">1.1.2</span> Reverse order</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><p>
Our current problem:
</p>

<pre class="example">
  We have a function (h :: a -&gt; a) which do transformations of x and
  we need to figure out that how many times h applied to x in order to
  reach the value '1'(some constant or pattern) in the terminating definiton of rec.
</pre></li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org166f52c"></a><b>If h is reversible(noted h', i.e. h . h' = id)</b><br />
<div class="outline-text-5" id="text-1-1-2-1">
<p>
we can build from bottom!
Notice that we need to pass our value of each layer to upper layer,
so we need one more parameter to record our current result.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">reverseBuild</span> f h x res <span style="color: #ff6347;">=</span> f x res
<span style="color: #edd400; font-weight: bold;">reverseBuild</span> f h y res <span style="color: #ff6347;">=</span> reverseBuild f h <span style="color: #ffd700;">(</span>h' y<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>f y res<span style="color: #ffd700;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>use foldl, foldr?</li>
</ul>
</div>
</li>

<li><a id="orgc55e914"></a><b>else h is not reversible:(</b><br />
<div class="outline-text-5" id="text-1-1-2-2">
<p>
well, which means we can't get results from bottom, we have to start from
head since we can not calculate (h $ h $ &#x2026; $ x). Maybe we need another strategy.
</p>
</div>
</li>

<li><a id="orge7a9c9a"></a><b>To change order&#x2026; How about <code>Monoid</code>?</b><br />
<div class="outline-text-5" id="text-1-1-2-3">
<p>
Suppose we want to get the sum of a list:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">sum</span> <span style="color: #ffd700; font-weight: bold;">[]</span> <span style="color: #ff6347;">=</span> 0
<span style="color: #edd400; font-weight: bold;">sum</span> <span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">=</span> x <span style="color: #ff6347;">+</span> sum xs
</pre>
</div>
<p>
where, <code>(+)</code> becomes the function <code>f</code>.
</p>

<p>
Since (a + b) + c <code>=</code> a + (b + c),
we can reverse the calculation order
</p>
<div class="org-src-container">
<pre class="src src-haskell">a <span style="color: #edd400; font-weight: bold;">+</span> <span style="color: #ffd700;">(</span>b <span style="color: #ff6347;">+</span> <span style="color: #00bfff;">(</span>c <span style="color: #ff6347;">+</span> d<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
to
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #ffd700;">(</span><span style="color: #00bfff;">(</span>a <span style="color: #ff6347;">+</span> b<span style="color: #00bfff;">)</span> <span style="color: #ff6347;">+</span> c<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">+</span> d
</pre>
</div>
<p>
It's just like to say that, we can change the calculation of
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">x</span> <span style="color: #ffd700;">(</span>h x<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>h <span style="color: #ff6347;">$</span> h x<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">...</span> <span style="color: #ffd700;">(</span>h <span style="color: #ff6347;">$</span> h <span style="color: #ff6347;">$</span> <span style="color: #ff6347;">...</span> <span style="color: #ff6347;">$</span> h x<span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
with <code>f</code>.
</p>

<p>
Let's try to implement this transformation with our general code:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">reverseOrder</span> f h 1 res <span style="color: #ff6347;">=</span> res
<span style="color: #edd400; font-weight: bold;">reverseOrder</span> f h x res <span style="color: #ff6347;">=</span> reverseOrder f h <span style="color: #ffd700;">(</span>h x<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>f x <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
This time we don't need <code>h'</code>!
</p>
</div>
</li>
