Note/Tailrec.org
***** *Being inspired by monoid, maybe be we can again generize our 'monoid approach' a little bit*

    This time instead of requiring f to be satisfiled by monoid law,
    we ourselves try to find a function =g= which satisfy the following law:
#+BEGIN_SRC haskell
g (g a b) c = f a (f b c)
#+END_SRC
    Now we can use our trick again:
#+BEGIN_SRC haskell
reverseOrder' g h 1 res = res
reverseOrder' g h x res = reverseOrder' g h (h x) (g x (h x))
#+END_SRC

    Even more general(although harder...), we can generalize function =h= too.
    Suppose we have our special function =g= and a new h function =p=.
    
    We have general rule:
#+BEGIN_SRC haskell
g (g x (p x)) (p $ p x) = f x (f (h x) (h $ h x))
or(with extra start x0)
g (g (g a x) (p x)) (p $ p x) = f x (f (h x) (h $ (h x)))
#+END_SRC
    What's more? We may Just add a new start data x0(just like foldl :-)

    The final version with extra x0(a is x0 at first):
#+BEGIN_SRC haskell
reverseOrder'' g p a 1 res = res
reverseOrder'' g p a x res = reverseOrder'' g p (p x) (g a x)
#+END_SRC
   
***** *Well, if we're not lucky.. we can't find a reverse h' nor monoid structure...*
     
    Two options:
    1) We still calculate from the beginning, but we pass the result as a =List= of (h $ ..x)s.
        But this is not efficient and ugly...
    2) Maybe it's time for our /CPS/ approach...

Time for the second idea!
**** CPS trasformation

CPS is a tool to convert recursive code to *tail call*.(note that this is different from tailrec).
Recall our =rec= function:
#+BEGIN_SRC haskell
rec 1 = some value
rec x = f x (rec (h x))
#+END_SRC

to /CPS/ style =>
#+BEGIN_SRC haskell
rec 1 c = c value
rec x c = rec (h x) (c . (f x))
#+END_SRC
It looks like we are just building our unfolded function chain.
Instead of accumulating results and values, we accumulate calculations(functions).

In fact, CPS can be used to convert any recursive function to tail-call form.
With CPS, we can build our executing stack from heap.

**** Summary
We have discussed several optimizations may be applied to list recursions.
Let's recap!

***** Tailrec
****** Calculating from bottom if reversible
****** Reverse calculation order
- By Monoid structure
- By special function g with specific rules
****** CPS transformation 

***** Dynamic Programming

*** Tree recursion
Well, it seems that linear tailrec is not easy now, how about tree tailrec?
**** Two-branch tree recursion
***** Formalization
#+BEGIN_SRC haskell
rec 1 = some value
rec x = f x (rec (g x)) (rec (h x))
#+END_SRC
If we unfold thie expression, this expression can be a very large binary-tree.
#+BEGIN_SRC 
                               f x
                     /                     \
          f $ g x                                 f $ h x
        /         \                            /           \
f $ g x $ g x     f $ g x $ h x    f $ h x $ g x            f $ h x $ h x

...
#+END_SRC
It looks like we are traversing all possible permutations of function =g= and =h= compositions

