Note/Tailrec.html

<li><a id="orgd6c3059"></a><b>Being inspired by monoid, maybe be we can again generize our 'monoid approach' a little bit</b><br />
<div class="outline-text-5" id="text-1-1-2-4">
<p>
This time instead of requiring f to be satisfiled by monoid law,
we ourselves try to find a function <code>g</code> which satisfy the following law:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">g</span> <span style="color: #ffd700;">(</span>g a b<span style="color: #ffd700;">)</span> c <span style="color: #ff6347;">=</span> f a <span style="color: #ffd700;">(</span>f b c<span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
Now we can use our trick again:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">reverseOrder'</span> g h 1 res <span style="color: #ff6347;">=</span> res
<span style="color: #edd400; font-weight: bold;">reverseOrder'</span> g h x res <span style="color: #ff6347;">=</span> reverseOrder' g h <span style="color: #ffd700;">(</span>h x<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>g x <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
Even more general(although harder&#x2026;), we can generalize function <code>h</code> too.
Suppose we have our special function <code>g</code> and a new h function <code>p</code>.
</p>

<p>
We have general rule:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">g</span> <span style="color: #ffd700;">(</span>g x <span style="color: #00bfff;">(</span>p x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>p <span style="color: #ff6347;">$</span> p x<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">=</span> f x <span style="color: #ffd700;">(</span>f <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span>h <span style="color: #ff6347;">$</span> h x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
or<span style="color: #ffd700;">(</span>with extra start x0<span style="color: #ffd700;">)</span>
<span style="color: #edd400; font-weight: bold;">g</span> <span style="color: #ffd700;">(</span>g <span style="color: #00bfff;">(</span>g a x<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span>p x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>p <span style="color: #ff6347;">$</span> p x<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">=</span> f x <span style="color: #ffd700;">(</span>f <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span>h <span style="color: #ff6347;">$</span> <span style="color: #ffa500;">(</span>h x<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
What's more? We may Just add a new start data x0(just like foldl :-)
</p>

<p>
The final version with extra x0(a is x0 at first):
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">reverseOrder''</span> g p a 1 res <span style="color: #ff6347;">=</span> res
<span style="color: #edd400; font-weight: bold;">reverseOrder''</span> g p a x res <span style="color: #ff6347;">=</span> reverseOrder'' g p <span style="color: #ffd700;">(</span>p x<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>g a x<span style="color: #ffd700;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgb3894bc"></a><b>Well, if we're not lucky.. we can't find a reverse h' nor monoid structure&#x2026;</b><br />
<div class="outline-text-5" id="text-1-1-2-5">
<p>
Two options:
</p>
<ol class="org-ol">
<li>We still calculate from the beginning, but we pass the result as a <code>List</code> of (h $ ..x)s.
But this is not efficient and ugly&#x2026;</li>
<li>Maybe it's time for our <i>CPS</i> approach&#x2026;</li>
</ol>

<p>
Time for the second idea!
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgd4d3431" class="outline-4">
<h4 id="orgd4d3431"><span class="section-number-4">1.1.3</span> CPS trasformation</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
CPS is a tool to convert recursive code to <b>tail call</b>.(note that this is different from tailrec).
Recall our <code>rec</code> function:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #729fcf; font-weight: bold;">rec</span> 1 <span style="color: #ff6347;">=</span> some value
<span style="color: #729fcf; font-weight: bold;">rec</span> x <span style="color: #ff6347;">=</span> f x <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
to <i>CPS</i> style =&gt;
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #729fcf; font-weight: bold;">rec</span> 1 c <span style="color: #ff6347;">=</span> c value
<span style="color: #729fcf; font-weight: bold;">rec</span> x c <span style="color: #ff6347;">=</span> <span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #ffd700;">(</span>h x<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>c <span style="color: #ff6347;">.</span> <span style="color: #00bfff;">(</span>f x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
It looks like we are just building our unfolded function chain.
Instead of accumulating results and values, we accumulate calculations(functions).
</p>

<p>
In fact, CPS can be used to convert any recursive function to tail-call form.
With CPS, we can build our executing stack from heap.
</p>
</div>
</div>

<div id="outline-container-org9fbdd0d" class="outline-4">
<h4 id="org9fbdd0d"><span class="section-number-4">1.1.4</span> Summary</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
We have discussed several optimizations may be applied to list recursions.
Let's recap!
</p>
</div>

<ol class="org-ol">
<li><a id="orgf0a3e8e"></a>Tailrec<br />
<ol class="org-ol">
<li><a id="org000cdc8"></a>Calculating from bottom if reversible<br /></li>
<li><a id="org3432e17"></a>Reverse calculation order<br />
<div class="outline-text-6" id="text-1-1-4-1-2">
<ul class="org-ul">
<li>By Monoid structure</li>
<li>By special function g with specific rules</li>
</ul>
</div>
</li>
<li><a id="org5a86b43"></a>CPS transformation<br /></li>
</ol>
</li>

<li><a id="orgfb86f6b"></a>Dynamic Programming<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org18f9b21" class="outline-3">
<h3 id="org18f9b21"><span class="section-number-3">1.2</span> Tree recursion</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Well, it seems that linear tailrec is not easy now, how about tree tailrec?
</p>
</div>
<div id="outline-container-orge8f2ddb" class="outline-4">
<h4 id="orge8f2ddb"><span class="section-number-4">1.2.1</span> Two-branch tree recursion</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="org12dbc14"></a>Formalization<br />
<div class="outline-text-5" id="text-1-2-1-1">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #729fcf; font-weight: bold;">rec</span> 1 <span style="color: #ff6347;">=</span> some value
<span style="color: #729fcf; font-weight: bold;">rec</span> x <span style="color: #ff6347;">=</span> f x <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>g x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
If we unfold thie expression, this expression can be a very large binary-tree.
</p>
<pre class="example">
                               f x
                     /                     \
          f $ g x                                 f $ h x
        /         \                            /           \
f $ g x $ g x     f $ g x $ h x    f $ h x $ g x            f $ h x $ h x

...
</pre>
<p>
It looks like we are traversing all possible permutations of function <code>g</code> and <code>h</code> compositions
</p>
</div>
</li>
