Note/Tailrec.org
***** A simple try 

A very simple idea is that if we can tailrec =rec=, then we want to cache result of last step:
#+BEGIN_SRC haskell
rec' x a 
  = p (rec x) a
  = p (f x (rec (g x)) (rec (h x))) a
#+END_SRC
What if...
#+BEGIN_SRC haskell
p (f x (rec (g x)) (rec (h x))) a 
  = (rec (g x)) `f x` (rec (h x)) `p` a
  if f x a b == a `q` x `q` b
  = (rec (g x)) `q` x `q` (rec (h x)) `p` a
  = (rec (g x)) `q` x `q` (p (rec (h x)) a)
  = (rec (g x)) `q` x `q` (rec' (h x) a)
  if p == q
  = (rec (g x)) `p` x `p` (rec' (h x) a)
  if (a `p` b) `p` c == a `p` (b `p` c)
  = (rec (g x)) `p` (x `p` (rec' (h x) a))
  = p (rec (g x)) (p x (rec' (h x) a))
  = rec' (g x) (p x (rec' (h x) a))
#+END_SRC
Wait! we have made too many assumptions!
Let's list them all:
#+BEGIN_SRC
1. rec' x a = p (rec x) a
2. f x a b = a `p` x `p` b
3. (a `p` x) `p` b = a `p` (x `p` b)
#+END_SRC
In words, we can find a function =p=, which 
1) can be expressed as a composition of
   raw tree recursion version and a accumulation value
2) Function =f= can in raw tree recursion can be decomposed as compositions of function =p=.
3) Function =p= satisfy _Monoid law_.

These constraints looks really strict and ugly...
The first condition is easy to reach since we can simply build a function =p=.
The second is hard. we need to decompose =f= to our built function =p=.
Well, I want to have a try.

Can this strategy solve =fib= problem?
#+BEGIN_SRC haskell
fib 0 = 0
fib 1 = 1
fib n = fib (n-1) + fib (n-2)
#+END_SRC
#+BEGIN_SRC haskell
rec x = f x (rec (g x)) (rec (h x))

rec = fib
f x a b = a + b
g = (minus 1)
h = (minus 2)
#+END_SRC
OK, Let's build function =p=.
#+BEGIN_SRC haskell
fib' n a 
  = fib n + a
  = fib (n-1) + fib (n-2) + a
  = fib (n-1) + fib' (n-2) a
  = fib' (n-1) (fib' (n-2) a)
#+END_SRC
Therefore,
#+BEGIN_SRC haskell
fib' 0 a = a
fib' 1 a = 1 + a
fib' n a = fib' (n-1) (fib' (n-2) a)
#+END_SRC
We succeeded!
However, this is just our first baby step, this is just =tail call=, not =tailrec=.



**** N-branch tree recursion

** Examples
*** Selection sort
*** Fibonacci
*** Permutations










