Note/Tailrec.html

<li><a id="org0d6371c"></a>A simple try<br />
<div class="outline-text-5" id="text-1-2-1-2">
<p>
A very simple idea is that if we can tailrec <code>rec</code>, then we want to cache result of last step:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">rec'</span> x a 
  <span style="color: #ff6347;">=</span> p <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> x<span style="color: #ffd700;">)</span> a
  <span style="color: #ff6347;">=</span> p <span style="color: #ffd700;">(</span>f x <span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #ffa500;">(</span>g x<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #ffa500;">(</span>h x<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> a
</pre>
</div>
<p>
What if&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">p</span> <span style="color: #ffd700;">(</span>f x <span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #ffa500;">(</span>g x<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #ffa500;">(</span>h x<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> a 
  <span style="color: #ff6347;">=</span> <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>g x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> `f x` <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347;">`p`</span> a
  <span style="color: #729fcf; font-weight: bold;">if</span> f x a b <span style="color: #ff6347;">==</span> a <span style="color: #ff6347;">`q`</span> x <span style="color: #ff6347;">`q`</span> b
  <span style="color: #ff6347;">=</span> <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>g x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347;">`q`</span> x <span style="color: #ff6347;">`q`</span> <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347;">`p`</span> a
  <span style="color: #ff6347;">=</span> <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>g x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347;">`q`</span> x <span style="color: #ff6347;">`q`</span> <span style="color: #ffd700;">(</span>p <span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #ffa500;">(</span>h x<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span> a<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347;">=</span> <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>g x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347;">`q`</span> x <span style="color: #ff6347;">`q`</span> <span style="color: #ffd700;">(</span>rec' <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span> a<span style="color: #ffd700;">)</span>
  <span style="color: #729fcf; font-weight: bold;">if</span> p <span style="color: #ff6347;">==</span> q
  <span style="color: #ff6347;">=</span> <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>g x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347;">`p`</span> x <span style="color: #ff6347;">`p`</span> <span style="color: #ffd700;">(</span>rec' <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span> a<span style="color: #ffd700;">)</span>
  <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #ffd700;">(</span>a <span style="color: #ff6347;">`p`</span> b<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">`p`</span> c <span style="color: #ff6347;">==</span> a <span style="color: #ff6347;">`p`</span> <span style="color: #ffd700;">(</span>b <span style="color: #ff6347;">`p`</span> c<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347;">=</span> <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>g x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ff6347;">`p`</span> <span style="color: #ffd700;">(</span>x <span style="color: #ff6347;">`p`</span> <span style="color: #00bfff;">(</span>rec' <span style="color: #ffa500;">(</span>h x<span style="color: #ffa500;">)</span> a<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
  <span style="color: #ff6347;">=</span> p <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>g x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>p x <span style="color: #00bfff;">(</span>rec' <span style="color: #ffa500;">(</span>h x<span style="color: #ffa500;">)</span> a<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
  <span style="color: #ff6347;">=</span> rec' <span style="color: #ffd700;">(</span>g x<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>p x <span style="color: #00bfff;">(</span>rec' <span style="color: #ffa500;">(</span>h x<span style="color: #ffa500;">)</span> a<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
Wait! we have made too many assumptions!
Let's list them all:
</p>
<pre class="example">
1. rec' x a = p (rec x) a
2. f x a b = a `p` x `p` b
3. (a `p` x) `p` b = a `p` (x `p` b)
</pre>
<p>
In words, we can find a function <code>p</code>, which 
</p>
<ol class="org-ol">
<li>can be expressed as a composition of
raw tree recursion version and a accumulation value</li>
<li>Function <code>f</code> can in raw tree recursion can be decomposed as compositions of function <code>p</code>.</li>
<li>Function <code>p</code> satisfy <span class="underline">Monoid law</span>.</li>
</ol>

<p>
These constraints looks really strict and ugly&#x2026;
The first condition is easy to reach since we can simply build a function <code>p</code>.
The second is hard. we need to decompose <code>f</code> to our built function <code>p</code>.
Well, I want to have a try.
</p>

<p>
Can this strategy solve <code>fib</code> problem?
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">fib</span> 0 <span style="color: #ff6347;">=</span> 0
<span style="color: #edd400; font-weight: bold;">fib</span> 1 <span style="color: #ff6347;">=</span> 1
<span style="color: #edd400; font-weight: bold;">fib</span> n <span style="color: #ff6347;">=</span> fib <span style="color: #ffd700;">(</span>n<span style="color: #ff6347;">-</span>1<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">+</span> fib <span style="color: #ffd700;">(</span>n<span style="color: #ff6347;">-</span>2<span style="color: #ffd700;">)</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #729fcf; font-weight: bold;">rec</span> x <span style="color: #ff6347;">=</span> f x <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>g x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #00bfff;">(</span>h x<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>

<span style="color: #729fcf; font-weight: bold;">rec</span> <span style="color: #ff6347;">=</span> fib
<span style="color: #edd400; font-weight: bold;">f</span> x a b <span style="color: #ff6347;">=</span> a <span style="color: #ff6347;">+</span> b
<span style="color: #edd400; font-weight: bold;">g</span> <span style="color: #ff6347;">=</span> <span style="color: #ffd700;">(</span>minus 1<span style="color: #ffd700;">)</span>
<span style="color: #edd400; font-weight: bold;">h</span> <span style="color: #ff6347;">=</span> <span style="color: #ffd700;">(</span>minus 2<span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
OK, Let's build function <code>p</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">fib'</span> n a 
  <span style="color: #ff6347;">=</span> fib n <span style="color: #ff6347;">+</span> a
  <span style="color: #ff6347;">=</span> fib <span style="color: #ffd700;">(</span>n<span style="color: #ff6347;">-</span>1<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">+</span> fib <span style="color: #ffd700;">(</span>n<span style="color: #ff6347;">-</span>2<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">+</span> a
  <span style="color: #ff6347;">=</span> fib <span style="color: #ffd700;">(</span>n<span style="color: #ff6347;">-</span>1<span style="color: #ffd700;">)</span> <span style="color: #ff6347;">+</span> fib' <span style="color: #ffd700;">(</span>n<span style="color: #ff6347;">-</span>2<span style="color: #ffd700;">)</span> a
  <span style="color: #ff6347;">=</span> fib' <span style="color: #ffd700;">(</span>n<span style="color: #ff6347;">-</span>1<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>fib' <span style="color: #00bfff;">(</span>n<span style="color: #ff6347;">-</span>2<span style="color: #00bfff;">)</span> a<span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
Therefore,
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">fib'</span> 0 a <span style="color: #ff6347;">=</span> a
<span style="color: #edd400; font-weight: bold;">fib'</span> 1 a <span style="color: #ff6347;">=</span> 1 <span style="color: #ff6347;">+</span> a
<span style="color: #edd400; font-weight: bold;">fib'</span> n a <span style="color: #ff6347;">=</span> fib' <span style="color: #ffd700;">(</span>n<span style="color: #ff6347;">-</span>1<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>fib' <span style="color: #00bfff;">(</span>n<span style="color: #ff6347;">-</span>2<span style="color: #00bfff;">)</span> a<span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
We succeeded!
However, this is just our first baby step, this is just <code>tail call</code>, not <code>tailrec</code>.
</p>
</div>
</li>
</ol>
</div>



<div id="outline-container-org90a4c7c" class="outline-4">
<h4 id="org90a4c7c"><span class="section-number-4">1.2.2</span> N-branch tree recursion</h4>
</div>
</div>
</div>

<div id="outline-container-orgd5cddf5" class="outline-2">
<h2 id="orgd5cddf5"><span class="section-number-2">2</span> Examples</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6911735" class="outline-3">
<h3 id="org6911735"><span class="section-number-3">2.1</span> Selection sort</h3>
</div>
<div id="outline-container-orga0abe8c" class="outline-3">
<h3 id="orga0abe8c"><span class="section-number-3">2.2</span> Fibonacci</h3>
</div>
<div id="outline-container-org38b745c" class="outline-3">
<h3 id="org38b745c"><span class="section-number-3">2.3</span> Permutations</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Comcx</p>
<p class="date">Created: 2020-02-26 周三 22:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
